# Creating and Managing Views
The code snippet demonstrates various aspects of creating and managing views in SQL.

1. Creating a simple view: The `employees_view` view is created to select specific columns from the `employees` table.

2. Creating a view with a WHERE clause: The `managers_view` view is created to select only the employees with the job title 'Manager'.

3. Creating a view with a JOIN: The `employee_department_view` view is created to join the `employees` and `departments` tables based on the department ID.

4. Creating a view with a subquery: The `high_salary_view` view is created to select employees with a salary higher than the average salary of all employees.

5. Creating a view with column aliases: The `employee_info_view` view is created with custom column names using column aliases.

6. Modifying a view: The `employees_view` view is altered to include the `salary` column from the `employees` table.

7. Dropping a view: The `employees_view` view is dropped if it exists.

8. Querying views: The created views are queried using SELECT statements.

Note: Views are virtual tables that are not physically stored in the database but can be used like regular tables for querying data.
```

In [ ]:
-- Creating a simple view
CREATE VIEW employees_view AS
SELECT employee_id, first_name, last_name, hire_date
FROM employees;

-- Creating a view with a WHERE clause
CREATE VIEW managers_view AS
SELECT employee_id, first_name, last_name, hire_date
FROM employees
WHERE job_title = 'Manager';

-- Creating a view with a JOIN
CREATE VIEW employee_department_view AS
SELECT e.employee_id, e.first_name, e.last_name, d.department_name
FROM employees e
JOIN departments d ON e.department_id = d.department_id;

-- Creating a view with a subquery
CREATE VIEW high_salary_view AS
SELECT employee_id, first_name, last_name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);

-- Creating a view with column aliases
CREATE VIEW employee_info_view (ID, Name, HireDate) AS
SELECT employee_id, CONCAT(first_name, ' ', last_name), hire_date
FROM employees;

-- Modifying a view
ALTER VIEW employees_view
AS
SELECT employee_id, first_name, last_name, hire_date, salary
FROM employees;

-- Dropping a view
DROP VIEW IF EXISTS employees_view;

-- Querying a view
SELECT * FROM employees_view;
SELECT * FROM managers_view;
SELECT * FROM employee_department_view;
SELECT * FROM high_salary_view;
SELECT * FROM employee_info_view;

# Benefits of Views
Explanation:
In this code snippet, we demonstrate the benefits of views in SQL. Views are virtual tables that are based on the result of a query. They provide a way to simplify complex queries, encapsulate logic, and provide a level of abstraction.

First, we create a table called "employees" and insert some sample data. Then, we create a view called "high_salary_employees" that selects employees with a salary greater than 5500. We can query the view just like a regular table, and it will always reflect the latest data from the underlying table.

Next, we update the salary of an employee in the original table. When we select from the view again, we can see that the view automatically reflects the updated salary.

Finally, we drop the view using the `DROP VIEW` statement. If we try to select from the dropped view, it will result in an error since the view no longer exists.

Views provide a way to simplify complex queries by encapsulating them into reusable objects. They can also be used to restrict access to certain columns or rows of a table, providing an additional layer of security.

In [ ]:
-- Create a table to demonstrate views
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    department VARCHAR(100),
    salary DECIMAL(10, 2)
);

-- Insert some sample data
INSERT INTO employees (id, name, department, salary)
VALUES (1, 'John Doe', 'IT', 5000),
       (2, 'Jane Smith', 'HR', 6000),
       (3, 'Mike Johnson', 'Finance', 7000);

-- Create a view to display employees with a salary greater than 5500
CREATE VIEW high_salary_employees AS
SELECT id, name, department, salary
FROM employees
WHERE salary > 5500;

-- Select all rows from the view
SELECT * FROM high_salary_employees;
-- Expected output: 
-- id |     name     | department | salary 
-- ----+--------------+------------+--------
--  2 | Jane Smith   | HR         | 6000.00
--  3 | Mike Johnson | Finance    | 7000.00

-- Update the salary of an employee in the original table
UPDATE employees
SET salary = 8000
WHERE id = 1;

-- Select all rows from the view again
SELECT * FROM high_salary_employees;
-- Expected output: 
-- id |     name     | department | salary 
-- ----+--------------+------------+--------
--  2 | Jane Smith   | HR         | 6000.00
--  3 | Mike Johnson | Finance    | 7000.00
--  1 | John Doe     | IT         | 8000.00

-- Drop the view
DROP VIEW high_salary_employees;

-- Try to select from the dropped view
SELECT * FROM high_salary_employees;
-- Expected output: ERROR:  relation "high_salary_employees" does not exist